Tutorials-3.0.1/case-subsonic/Piso-3/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoFinal)"
    {
        solver          diagonal;
    }
    
    "(U|UFinal)"
    {
        solver          PBiCG;
        preconditioner	DILU;
        tolerance       1e-09;
        relTol          0.0;
    }
    
    "(p|pFinal)"
    {
        solver          PBiCG;
        preconditioner	DILU;
        tolerance       1e-09;
        relTol          0.0;
    }

    "(h|hFinal)"
    {
        $U;
    }
}

PIMPLE
{
    momentumPredictor	false; //true;
    nCorrectors		1;
    nonOrthogonalityThreshold	60;
    skewnessThreshold		0.5;
    updateEnergyInPISO false;
    transonic true;
}

// ************************************************************************* //
